{"example_queries":["rice dishes","rice cuisine","rice"],"theme":"rice","description":"Rice dishes are enjoyed by people all over the world and come in many different forms. In Asian cultures, rice is often eaten with chopsticks and is used as a base for many different dishes. In Japanese cuisine, sushi is a popular dish that consists of cooked rice that is vinegar flavored and rolled with seafood or vegetables. In Chinese cuisine, rice is often stir fried with vegetables or meat. In India, rice is a staple food and is often served with curries or lentils. Rice dishes vary greatly in flavor and ingredients depending on the culture in which they are made.","trivia":["Rice is the seed of the grass species Oryza sativa","Rice is the staple food for over half the world's population","Rice is grown on more land area than any other commercial food","In some cultures, rice is symbolically thrown at weddings for good luck"],"popular_tasks":["sushi","fried rice","jambalaya","paella","pilaf","risotto","biryani"],"clarifying_questions":["What country's cuisine would you like to explore today?","What type of rice dish are you in the mood for?","Do you have any dietary restrictions?"], "curated_taskmaps": []}
{"example_queries":["woodworking","working with wood","woodcraft"],"theme":"woodworking","description":"Woodworking is the process of making things out of wood. It is an ancient art that has been practiced by cultures around the world for centuries. There are many different types of woodworking, each with its own unique techniques and styles.  Some of the most popular types of woodworking include carpentry, which is the art of making furniture and other wooden objects; woodturning, which is the art of making bowls, plates, and other objects out of wood; and woodcarving, which is the art of carving designs into wood.  Woodworking is a popular hobby for many people, and it can also be a very rewarding career. If you are interested in learning more about woodworking, there are many resources available online and in libraries.","trivia":["Woodworking is one of the oldest human occupations, dating back to the Stone Age.","The first recorded use of the term \\u201cwoodworking\\u201d dates back to the 14th century.","Woodworking is a popular hobby for many people, and it can also be a very rewarding career."],"popular_tasks":["Chairs","Tables","Cabinets"],"clarifying_questions":["What type of woodworking do you want to learn?","What type of projects are you interested in?","What is your budget for tools and materials?"], "curated_taskmaps": []}
{"example_queries":["I want to cook a pasta","pasta dish","the best pasta dish"],"theme":"pasta","description":"I recently learned that pasta is a type of food typically made from an unleavened dough of wheat flour mixed with water or eggs, and formed into sheets or other shapes, then cooked by boiling or baking. Sometimes, when I make my own pasta, I use rice flour, or legumes such as beans or lentils to yield a different taste and texture, or as a gluten-free alternative.","trivia":["Pastas are divided into two broad categories: dried (pasta secca) and fresh (pasta fresca)","Most dried pasta is produced commercially via an extrusion process, although it can be produced at home.","Fresh pasta is traditionally produced by hand, sometimes with the aid of simple machines."],"popular_tasks":["Spaghetti puttanesca","Pasta alla vodka","Cacio e pepe"],"clarifying_questions":["What type of pasta do you want to make?"],"curated_taskmaps":[]}
